In [2]:
import pandas as pd

In [19]:
df = pd.DataFrame({'A': [1,2,3], 'B': [4,5,6]})

### sidebyside

In [7]:
from pdi import sidebyside as sbs

In [8]:
sbs(df)

,A,B
0,1,4
1,2,5
2,3,6

In [9]:
sbs(df, index=False)

A,B
1,4
2,5
3,6

In [10]:
sbs(df, df)

,A,B
0,1,4
1,2,5
2,3,6
,A,B
0,1,4
1,2,5
2,3,6

In [11]:
sbs(df.A)

,A
0,1
1,2
2,3

In [12]:
sbs(df.A, df.B)

,A
0,1
1,2
2,3
,B
0,4
1,5
2,6

In [13]:
sbs(df.index, df.A, df.B)

,
0,
1,
2,
,A
0,1
1,2
2,3
,B
0,4
1,5
2,6

In [14]:
sbs(df.index, df.A, df.B, index=False)

### patch_series

In [4]:
df.A

0    1
1    2
2    3
Name: A, dtype: int64

In [21]:
pdi.patch_series()

In [22]:
df.A

0    1
1    2
2    3
Name: A, dtype: int64

### multiindex

In [23]:
df = pd.read_csv('cities-states.csv', index_col=('city', 'state'))

In [24]:
df

                      population    lat     lon
city        state
Portland    Oregon        609456  45.52 -122.68
Springfield Illinois      117006  39.78  -89.65
Portland    Maine          66318  43.66  -70.26
Springfield Oregon         60177  44.05 -123.02

In [25]:
sbs(df.population, df.lat, df.lon)

,,population
city,state,
Portland,Oregon,609456
Springfield,Illinois,117006
Portland,Maine,66318
Springfield,Oregon,60177
,,lat
city,state,
Portland,Oregon,45.52
Springfield,Illinois,39.78
Portland,Maine,43.66
Springfield,Oregon,44.05
,,lon
city,state,
Portland,Oregon,-122.68
Springfield,Illinois,-89.65
Portland,Maine,-70.26
Springfield,Oregon,-123.02

In [30]:
sbs(df.index, df.population, df.lat, df.lon, index=False)

In [31]:
sbs(df.index, df.population, df.lat, df.lon, index=False, valign='bottom')

In [32]:
df = df.T

In [33]:
df

city         Portland Springfield  Portland Springfield
state          Oregon    Illinois     Maine      Oregon
population  609456.00   117006.00  66318.00    60177.00
lat             45.52       39.78     43.66       44.05
lon           -122.68      -89.65    -70.26     -123.02

In [34]:
df['Portland', 'Oregon']

population    609456.00
lat               45.52
lon             -122.68
Name: (Portland, Oregon), dtype: float64

In [35]:
pdi.patch_series(footer=False)

In [36]:
df['Portland', 'Oregon']

population    609456.00
lat               45.52
lon             -122.68
Name: (Portland, Oregon), dtype: float64